{
    "ABET": [
        "An ability to identify, formulate, and solve complex engineering problems by applying principles of engineering, science, and mathematics",
        "An ability to apply engineering design to produce solutions that meet specified needs with consideration of public health, safety, and welfare, as well as global, cultural, social, environmental, and economic factors",
        "An ability to communicate effectively with a range of audiences",
        "An ability to recognize ethical and professional responsibilities in engineering situations and make informed judgments, which must consider the impact of engineering solutions in global, economic, environmetal, and societal contexts",
        "An ability to function effectively on a team whose members together provide leadership, create a collaborative and inclusive environmetna, establish goals, plan tasks, and meet objectives",
        "An ability to develop and conduct appropriate experimentation, analyze and interpret data, and use engineering judgement to draw conclusions",
        "An ability to acquire and apply new knowledge as needed, using appropriate learning strategies"
    ],
    "levels": {
            "0": {
            "display_name": "Remembering",
            "def": "Remembering involves recognizing or recalling relevant facts, terms, concepts, knowledge, or answers.",
            "verbs": [
                    "define",
                    "describe",
                    "identify",
                    "label",
                    "list",
                    "match",
                    "name",
                    "order",
                    "recall",
                    "select"
                ]

        },
        "1": {
            "display_name": "Understanding",
            "def": "Understanding involved constructing meaning from instructional messages.",
            "verbs": [
                    "illustrate",
                    "compare",
                    "distinguish",
                    "estimate",
                    "explain",
                    "classify",
                    "interpret",
                    "predict",
                    "summarize",
                    "translate"
                ]

        },
        "2": {
            "display_name": "Applying",
            "def": "Applying involves using ideas and concepts to solve problems.",
            "verbs": [
                    "organize",
                    "solve",
                    "demonstrate",
                    "discover",
                    "modify",
                    "operate",
                    "predict",
                    "prepare",
                    "produce",
                    "relate",
                    "solve",
                    "choose"
                ]

        },
        "3": {
            "display_name": "Analyzing",
            "def": "Analyzing involves breaking something down into components, seeing relationships and overall structure.",
            "verbs": [
                    "analyze",
                    "break down",
                    "compare",
                    "select",
                    "contrast",
                    "deconstruct",
                    "discriminate",
                    "distinguish",
                    "differentiate",
                    "outline",
                    "interelate"
                ]

        },
        "4": {
            "display_name": "Evaluating",
            "def": "Evaluating involves making judgments based on criteria and standards.",
            "verbs": [
                    "rate",
                    "assess",
                    "monitor",
                    "check",
                    "test",
                    "judge",
                    "critique",
                    "recommend",
                    "interpret",
                    "weigh"
                ]

        },
        "5": {
            "display_name": "Creating",
            "def": "Creating involves reorganizing diverse elements to form a new pattern or structure.",
            "verbs": [
                    "generate",
                    "plan",
                    "compose",
                    "develop",
                    "create",
                    "invent",
                    "organize",
                    "construct",
                    "produce",
                    "compile",
                    "design",
                    "devise"
                ]
        }
    }
}
